name: "myLayer"
layer {
  name: 'data'
  type: 'Python'
  top: 'img_shop'
  top: 'img_cumstom'
  top: 'label'
  python_param {
    module: 'dataLayer'
    layer: 'MydataLayer'
  }
}
layer {
  name: 'feature_extract'
  type: 'Python'
  bottom: "img_shop"
  bottom: "img_cumstom"
  top: 'shop_feature'
  top: 'cumstom_feature'
  python_param {
    module: 'dataLayer'
    layer: 'MyfeatureLayer'
  }
}